rollerOpt_COBYLA_NEW/system/blockMeshDict
/*---------------------------------------------------------------------------*\
| =========                 |                                                 |
| \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox           |
|  \\    /   O peration     | Version:  4.x                                   |
|   \\  /    A nd           | Web:      www.OpenFOAM.org                      |
|    \\/     M anipulation  |                                                 |
\*---------------------------------------------------------------------------*/
FoamFile
{
    version     2.0;
    format      ascii;
    class       dictionary;
    object      blockMeshDict;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

convertToMeters 1;

vertices
(
    (-1		0	0)
    (1		0	0)
    (1		1	0)
    (-1		1	0)
    (-1		0	0.1)
    (1		0	0.1)
    (1		1	0.1)
    (-1		1	0.1)

);

blocks
(
    hex (0 1 2 3 4 5 6 7) (100 50 1) simpleGrading (1 1 1)
);

edges
(
);

boundary
(
    lowerOutlet
    {
        type patch;
        faces
        (
            (0 1 5 4)
        );
    }
    top
    {
        type patch;
        faces
        (
            (3 2 6 7)
        );
    }
    sides
    {
        type patch;
        faces
        (
            (1 5 6 2)
            (0 4 7 3)
            //(0 1 2 3)
            //(4 5 6 7)
        );
    }

    front
    {
        type empty;
        faces
        (
            (0 1 2 3)
        );
    }

    back
    {
        type empty;
        faces
        (
            (4 5 6 7)
        );
    }

);

mergePatchPairs
(
);

// ************************************************************************* //
