rollerOpt_COBYLA_NEW/0/p
/*--------------------------------*- C++ -*----------------------------------*\
| =========                 |                                                 |
| \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox           |
|  \\    /   O peration     | Version:  2.2.1                                 |
|   \\  /    A nd           | Web:      www.OpenFOAM.org                      |
|    \\/     M anipulation  |                                                 |
\*---------------------------------------------------------------------------*/
FoamFile
{
    version     2.0;
    format      ascii;
    class       volScalarField;
    object      p;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

dimensions      [1 -1 -2 0 0 0 0];

internalField   uniform 101325;

boundaryField
{

    roller
    {
        type            calculated;
	value		$internalField;
    }

    top
    {
        type            calculated;
	value		$internalField;
    }

    burner
    {
        type            calculated;
	value		$internalField;
    }

    sides
    {
        type            calculated;
	value 		$internalField;
    }

    lowerOutlet
    {
	type		calculated;
	value		$internalField;
    }
}

// ************************************************************************* //
