rollerOpt_COBYLA_NEW/0/k
/*--------------------------------*- C++ -*----------------------------------*\
| =========                 |                                                 |
| \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox           |
|  \\    /   O peration     | Version:  2.2.1                                 |
|   \\  /    A nd           | Web:      www.OpenFOAM.org                      |
|    \\/     M anipulation  |                                                 |
\*---------------------------------------------------------------------------*/
FoamFile
{
    version     2.0;
    format      ascii;
    class       volScalarField;
    location    "0";
    object      k;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

dimensions      [0 2 -2 0 0 0 0];

internalField   uniform 1e-4;

boundaryField
{

    roller
    {
//	type		zeroGradient;
//	type		fixedValue;
//	type		kqRWallFunction;
	type		kLowReWallFunction;
       value           uniform 1e-9;
    }

    burner
    {
//	type		zeroGradient;
	type		fixedValue;
//        type            kqRWallFunction;
        value           uniform 1e-4;
    }

    top
    {
        type            inletOutlet;
	inletValue	uniform 1e-4;
	value 		uniform 1e-4;
    }

    sides
    {
        type            inletOutlet;
	inletValue	uniform 1e-4;
	value		uniform 1e-4;
    }

    lowerOutlet
    {
	type		inletOutlet;
	inletValue	uniform 1e-4;
	value		uniform 1e-4;
    }
}


// ************************************************************************* //
