rollerOpt_COBYLA_NEW/system/dakotaParameters.orig
//- This file contains the parameters that can be changed
//  Dakota will change the parameters with {} and the name 
//  corresponds to the variables in the dakotaDict

burnerT = {burnerT}
rollerOmega = {rollerOmega}
burnerUy = {burnerUy}
rollerDist = {rollerDist}
