rollerOpt_COBYLA_NEW/Allrun_noOpt
#!/bin/bash

cp -rf 0_backup 0

source createMesh

mkdir runLogs

mv log.* runLogs

echo "running solver"

source runSolver

echo "run finished"

